Repository: kellymugabo/ishare_backend
Catalog: ishare_app/lib/l10n/app_*.arb
Languages: fr, rw

source: Home
fr: Accueil
rw: Ahabanza

source: Find
fr: Rechercher
rw: Shakisha

source: Trips
fr: Trajets
rw: Ingendo

source: Profile
fr: Profil
rw: Konti

source: Good morning,
fr: Bonjour,
rw: Mwaramutse,

source: Where to next?
fr: Où allez-vous?
rw: Turajya he?

source: Search Rides
fr: Rechercher des trajets
rw: Shaka Imodoka

source: Current location
fr: Position actuelle
rw: Aho uri ubu

source: Enter destination...
fr: Entrez la destination...
rw: Aho ugiye...

source: Quick Actions
fr: Actions Rapides
rw: Ibikorwa byihuse

source: Find Ride
fr: Trouver un trajet
rw: Shaka Urugendo

source: Book Now
fr: Réserver
rw: Bika umwanya

source: Offer Ride
fr: Proposer un trajet
rw: Tanga Urugendo

source: Earn Money
fr: Gagner de l'argent
rw: Korera amafaranga

source: Safety Center
fr: Sécurité
rw: Umutekano

source: Guidelines
fr: Directives
rw: Amabwiriza

# aboutUs
source: About iShare
fr: À Propos
rw: Abo Turi Bo

source: Our Story
fr: Notre histoire
rw: Inkuru yacu

source: Recommended
fr: Recommandé
rw: Ibyifujwe

source: See All
fr: Voir tout
rw: Reba Byose

source: Why iShare?
fr: Pourquoi iShare ?
rw: Kuki iShare?

source: Save Costs
fr: Économiser
rw: Zigama

# saveCostsDesc
source: Share fuel costs and save on every trip.
fr: Voyagez moins cher.
rw: Genda ku giciro gito.

source: Eco-Friendly
fr: Écologique
rw: Kurengera Ibidukikije

# ecoFriendlyDesc
source: Reduce your carbon footprint by sharing rides.
fr: Réduisez l'empreinte carbone.
rw: Gabanya imyuka ihumanya.

source: Community
fr: Communauté
rw: Umuryango

# communityDesc
source: Connect with great people in your area.
fr: Connectez-vous aux autres.
rw: Menyana n'abantu bashya.

# seatsLeft
source: {count} seats left
fr: {count} places restantes
rw: Imyanya {count} yasigaye

source: Total Price
fr: Prix Total
rw: Igiciro cyose

source: Pick-up
fr: Départ
rw: Aho guhagurukira

source: Drop-off
fr: Arrivée
rw: Aho kuviramo

source: Account Settings
fr: Paramètres du compte
rw: Igenamiterere rya Konti

source: Contact Us
fr: Contactez-nous
rw: Twandikire

source: Log Out
fr: Se déconnecter
rw: Sohoka

# paymentTitle
source: Payment
fr: Paiement
rw: Kwishura

source: Verification Required
fr: Vérification requise
rw: Emeza Umwirondoro

# verifyAccountMsg
source: Please verify your account before making payment.
fr: Veuillez vérifier votre compte avant d'effectuer le paiement.
rw: Nyabuneka banza wemeze konti yawe mbere yo kwishura.

source: Cancel
fr: Annuler
rw: Kureka

source: Verify Now
fr: Vérifier maintenant
rw: Emeza Ubu

source: Payment Initiated
fr: Paiement initié
rw: Kwishura byatangiye

# checkPhoneMsg
source: Please check your phone for payment confirmation.
fr: Veuillez vérifier votre téléphone pour une confirmation de paiement.
rw: Reba kuri telefone yawe wemeze ubwishyu.

source: Transaction ID
fr: ID de transaction
rw: Nomero y'ubwishyu

source: Amount
fr: Montant
rw: Amafaranga

source: Done
fr: Terminé
rw: Byakozwe

source: Payment Failed
fr: Paiement échoué
rw: Kwishura byanze

source: Account Verified
fr: Compte vérifié
rw: Konti Yemewe

source: Account Not Verified
fr: Compte non vérifié
rw: Konti Ntiyemewe

source: Total Amount
fr: Montant total
rw: Amafaranga Yose

source: Select Payment Method
fr: Sélectionnez le mode de paiement
rw: Hitamo uburyo bwo kwishura

source: Card Payment
fr: Paiement par carte
rw: Ikarita ya Banki

# cardPaymentComingSoon
source: Card payment integration coming soon. Please use Mobile Money for now.
fr: L'intégration du paiement par carte arrive bientôt. Veuillez utiliser Mobile Money pour le moment.
rw: Ubu buryo buracyaza. Koresha Mobile Money.

source: Bank Transfer
fr: Virement bancaire
rw: Kohereza kuri Banki

# bankTransferDetails
source: Bank transfer details will be sent to your email.
fr: Les détails du virement bancaire seront envoyés à votre email.
rw: Amakuru yo kwishyura kuri banki azoherezwa kuri imeri.

source: Phone Number
fr: Numéro de téléphone
rw: Nimero ya Terefone

# paymentPromptMsg
source: You will receive a payment prompt on this number
fr: Vous recevrez une demande de paiement sur ce numéro
rw: Urahabwa ubutumwa bwo kwemeza kuri iyi nimero

source: Pay Now
fr: Payer maintenant
rw: Ishura

# verifyToPay
source: Verify Account to Pay
fr: Vérifier le compte pour payer
rw: Emeza Konti Wishure

source: Verify Identity
fr: Vérifier l'identité
rw: Emeza Umwirondoro

# verifyIdentityTitle
source: Verify Your Identity
fr: Confirmez votre identité
rw: Emeza Umwirondoro Wawe

# verifyIdentitySubtitle
source: We need to verify your identity before you can post a trip
fr: Nous devons vérifier votre identité avant que vous puissiez publier un trajet
rw: Tugomba kwemeza umwirondoro wawe mbere y'uko utanga urugendo

source: Full Name
fr: Nom complet
rw: Amazina Yuzuye

# fullNameHint
source: Enter your full name
fr: Entrez votre nom complet
rw: Injiza amazina yawe yuzuye

# nationalIdLabel
source: National ID Number
fr: Numéro de carte d'identité nationale
rw: Nimero y'Indangamuntu

# idHelperText
source: 16 digits
fr: 16 chiffres
rw: Imibare 16

# paymentMethodsAccepted
source: Accepted: MTN Mobile Money, Airtel Money
fr: Acceptés: MTN Mobile Money, Airtel Money
rw: Twakira: MTN Mobile Money, Airtel Money

# iAgreeTo
source: I agree to the
fr: J'accepte les
rw: Nemera

source: Terms and Conditions
fr: Conditions générales
rw: Amabwiriza n'Amategeko

# and
source: and the
fr: et la
rw: na

source: Privacy Policy
fr: Politique de confidentialité
rw: Politiki y'Ibanga

source: Confirm and Continue
fr: Confirmer et continuer
rw: Emeza Ukomeze

# secureInfoMsg
source: Your information is encrypted and secure
fr: Vos informations sont cryptées et sécurisées
rw: Amakuru yawe arafunzwe kandi afite umutekano

# enterFullName
source: Enter your full name
fr: Entrez votre nom complet
rw: Injiza amazina yawe yuzuye

# enterTwoNames
source: Enter at least two names
fr: Entrez au moins deux noms
rw: Injiza amazina abiri nibura

# invalidNameChars
source: Names must contain only letters
fr: Les noms doivent contenir uniquement des lettres
rw: Amazina agomba kuba afite inyuguti gusa

# enterNationalId
source: Enter your national ID
fr: Entrez votre carte d'identité nationale
rw: Injiza nimero y'indangamuntu

# invalidIdLength
source: National ID must be 16 digits
fr: La carte d'identité doit comporter 16 chiffres
rw: Indangamuntu igomba kuba ifite imibare 16

# invalidIdChars
source: ID must contain only digits
fr: L'ID doit contenir uniquement des chiffres
rw: Indangamuntu igomba kuba ifite imibare gusa

# enterPhoneNumber
source: Enter your phone number
fr: Entrez votre numéro de téléphone
rw: Injiza nimero ya terefone

# invalidPhone
source: Enter a valid Rwandan phone number
fr: Entrez un numéro rwandais valide
rw: Injiza nimero y'u Rwanda nziza

# acceptTerms
source: Accept terms before continuing
fr: Acceptez les conditions avant de continuer
rw: Emera amabwiriza mbere yo gukomeza

# verificationSuccess
source: Verification Successful!
fr: Vérification réussie!
rw: Kwemeza Byagenze Neza!

# verificationSuccessMsg
source: Your identity has been verified. You can now start your trip.
fr: Votre identité a été vérifiée. Vous pouvez maintenant commencer votre trajet.
rw: Umwirondoro wawe wemerejwe neza. Ubu ushobora gutangiza urugendo rwawe.

# continueText
source: Continue
fr: Continuer
rw: Komeza

source: Route
fr: Itinéraire
rw: Inzira

source: Vehicle
fr: Véhicule
rw: Ikinyabiziga

source: Details
fr: Détails
rw: Amakuru

source: Review
fr: Révision
rw: Inshamake

source: Starting Point
fr: Point de départ
rw: Aho guhagurukira

source: Vehicle Model
fr: Modèle de véhicule
rw: Ubwoko bw'imodoka

source: Vehicle Photo
fr: Photo du véhicule
rw: Ifoto y'imodoka

# uploadCarPhoto
source: Tap to upload photo
fr: Appuyez pour télécharger une photo
rw: Kanda hano ushyireho ifoto

source: Departure Time
fr: Heure de départ
rw: Igihe cyo guhaguruka

source: Price
fr: Prix
rw: Igiciro

# planRoute
source: Plan Your Route
fr: Planifiez votre itinéraire
rw: Tegura Inzira

source: Vehicle Details
fr: Détails du véhicule
rw: Amakuru y'Imodoka

# tripInfo
source: Trip Information
fr: Informations sur le trajet
rw: Amakuru y'Urugendo

source: Summary
fr: Résumé
rw: Inshamake

# planRouteDesc
source: Where are you starting and where are you going?
fr: Où commencez-vous et où allez-vous?
rw: Urahagurukira he kandi urajya he?

# vehicleDetailsDesc
source: Tell passengers about your vehicle.
fr: Parlez de votre véhicule aux passagers.
rw: Bwira abagenzi ibyerekeye imodoka yawe.

# tripInfoDesc
source: Set your schedule and pricing.
fr: Définissez votre horaire et vos prix.
rw: Hitamo igihe n'igiciro.

# summaryDesc
source: Review everything before publishing.
fr: Vérifiez tout avant de publier.
rw: Reba niba byose ari byo mbere yo gutangaza.

source: Publish Ride
fr: Publier le trajet
rw: Tangaza Urugendo

# fillFormHelp
source: Fill out the form to publish a trip.
fr: Remplissez le formulaire pour publier un trajet.
rw: Uzuza iyi fomu kugira ngo utangaze urugendo.

source: From
fr: De
rw: Aho uvuye

source: To
fr: À
rw: Aho ugiye

# searchComingSoon
source: Search feature coming soon!
fr: La fonction de recherche arrive bientôt!
rw: Gushakisha biracyaza!

# searchFeatureDesc
source: You'll be able to search for trips by location, date, and price here.
fr: Vous pourrez rechercher des trajets par lieu, date et prix ici.
rw: Uzabasha gushakisha ingendo ukoresheje aho ugiye, igihe, n'igiciro hano.

source: Emergency SOS
fr: SOS d'urgence
rw: Ubutabazi bwa SOS

# sosActive
source: SOS Alert Active
fr: Alerte SOS active
rw: SOS Yarakoreshejwe

# pressAndHold
source: Press and hold for 3 seconds
fr: Appuyez et maintenez pendant 3 secondes
rw: Kanda umare amasegonda 3

source: SOS Activated
fr: SOS activé
rw: SOS Yemejwe

# emergencyAlertSent
source: Emergency alert sent to:
fr: L'alerte d'urgence a été envoyée à:
rw: Ubutumwa bwo gutabaza bwoherejwe kuri:

source: Emergency Contacts
fr: Contacts d'urgence
rw: Nimero z'Ubutabazi

# ishareSupport
source: iShare Support Team
fr: Équipe de support iShare
rw: Itsinda rya iShare

# currentTripDriver
source: Your driver/passenger for current trip
fr: Votre chauffeur/passager du trajet actuel
rw: Umushoferi/Umugenzi muri kumwe

# liveLocationShared
source: Your live location is being shared.
fr: Votre position en direct est partagée.
rw: Aho uherereye harimo gusangizwa abandi.

source: Call 112
fr: Appeler le 112
rw: Hamagara 112

source: Share Location
fr: Partager la position
rw: Sangiza Aho Uri

# shareLocationDesc
source: Your current location will be shared with your selected contacts via SMS.
fr: Votre position actuelle sera partagée avec vos contacts sélectionnés par SMS.
rw: Aho uherereye harohererezwa abo wahisemo ukoresheje SMS.

# locationSharedSuccess
source: Location shared successfully!
fr: Position partagée avec succès!
rw: Aho uherereye hasangijwe neza!

source: Share
fr: Partager
rw: Sangiza

source: Cancel Trip
fr: Annuler le trajet
rw: Hagarika Urugendo

# tripCancelRequest
source: Trip cancellation request
fr: Demande d'annulation de trajet
rw: Gusaba guhagarika urugendo byakiriwe

# police
source: Rwanda National Police
fr: Police nationale du Rwanda
rw: Polisi y'u Rwanda

source: Fire Brigade
fr: Pompiers
rw: Kuzimya Inkongi

source: Emergency Services
fr: Services d'urgence
rw: Serivisi z'Ubutabazi

source: Safety Tips
fr: Conseils de sécurité
rw: Inama z'Umutekano

# verifyDriver
source: Verify Driver Details
fr: Vérifier les détails du chauffeur
rw: Genzura Umushoferi

# verifyDriverDesc
source: Always verify the driver's name, photo, and vehicle details before getting in.
fr: Vérifiez toujours le nom, la photo et les détails du véhicule du chauffeur avant d'entrer.
rw: Buri gihe genzura izina, ifoto n'imodoka by'umushoferi mbere yo kwinjira.

# shareTrip
source: Share Trip Details
fr: Partager les détails du trajet
rw: Sangiza Amakuru y'Urugendo

# shareTripDesc
source: Share your trip details with friends or family before you leave.
fr: Partagez les détails de votre trajet avec vos amis ou votre famille avant de partir.
rw: Sangiza inshuti n'umuryango amakuru y'urugendo mbere yo gutangira.

source: Stay Connected
fr: Restez connecté
rw: Guma ku Murongo

# stayConnectedDesc
source: Keep your phone charged and accessible during the trip.
fr: Gardez votre téléphone chargé et accessible pendant le trajet.
rw: Irinde ko telefone yawe ishala umuriro mu gihe cy'urugendo.

source: Check Ratings
fr: Vérifier les évaluations
rw: Reba Amanota

# checkRatingsDesc
source: Check ratings and reviews from other passengers about the driver.
fr: Consultez les évaluations et commentaires des autres passagers sur le chauffeur.
rw: Reba amanota n'ibitekerezo by'abandi bagenzi ku mushoferi.

source: Report Issues
fr: Signaler des problèmes
rw: Rapora Ibibazo

# reportIssuesDesc
source: Report any suspicious behavior or safety concerns immediately.
fr: Signalez immédiatement tout comportement suspect ou préoccupation de sécurité.
rw: Rapora vuba na bwangu imyitwarire itari myiza cyangwa ikibazo cy'umutekano.

# safetyMatters
source: Your Safety Matters
fr: Votre sécurité compte
rw: Umutekano Wawe Uraduhangayikishije

# safetyCommitment
source: iShare is committed to providing a safe and secure ride-sharing experience. All drivers are verified.
fr: iShare s'engage à fournir une expérience de covoiturage sûre et sécurisée. Tous les chauffeurs sont vérifiés.
rw: iShare yiyemeje gutanga serivisi z'ingendo zitekanye. Abashoferi bose baragenzuwe.

source: Call
fr: Appeler
rw: Hamagara

source: About iShare
fr: À propos d'iShare
rw: Ibyerekeye iShare

# appTagline
source: Share the Ride, Share the Cost
fr: Partagez le trajet, partagez les coûts
rw: Sangira Urugendo, Gabanya Ikiguzi

# appDescriptionShort
source: Smart ride-sharing and cost-sharing platform
fr: Plateforme intelligente de covoiturage et de partage des coûts
rw: Urubuga rwo gusangira ingendo n'ibiciro

# visionText
source: Revolutionizing transportation in Rwanda and East Africa by creating a reliable, eco-friendly, and affordable ride-sharing network.
fr: Révolutionner le transport au Rwanda et en Afrique de l'Est en créant un réseau de covoiturage fiable, écologique et abordable.
rw: Guhindura uburyo bwo gutwara abantu mu Rwanda no muri Afurika y'Iburasirazuba, dushyiraho urusobe rw'ingendo zizewe, zita ku bidukikije, kandi zihendutse.

# missionText
source: Connecting car owners with empty seats to passengers going the same direction, reducing transport costs, road congestion, and carbon emissions.
fr: Connecter les propriétaires de voitures avec des sièges vides aux passagers allant dans la même direction, réduisant les coûts de transport, la congestion routière et les émissions de carbone.
rw: Guhuza abafite imodoka zifite imyanya irimo ubusa n'abagenzi berekeza hamwe, kugabanya ibiciro by'ingendo, ubucucike, n'ibyuka bihumanya.

# problemTitle
source: ❓ The Problem
fr: ❓ Le problème
rw: ❓ Ikibazo

# problemText
source: Fuel prices are rising, road congestion is increasing, and public transport can be inconvenient. Many private cars travel with 3-4 empty seats.
fr: Les prix du carburant augmentent, la congestion routière s'intensifie et les transports publics peuvent être peu pratiques. De nombreuses voitures privées voyagent avec 3-4 sièges vides.
rw: Ibiciro bya lisansi birazamuka, ubucucike mu muhanda buriyongera. Imodoka nyinshi zigenda zifite imyanya 3-4 irimo ubusa.

# solutionTitle
source: ✅ Our Solution
fr: ✅ Notre solution
rw: ✅ Igisubizo Cyacu

# solutionText
source: iShare connects drivers and passengers. Drivers earn money to offset fuel costs, and passengers travel comfortably at a lower price.
fr: iShare connecte les chauffeurs et les passagers. Les chauffeurs gagnent de l'argent pour compenser les coûts de carburant, et les passagers voyagent confortablement à un prix inférieur.
rw: iShare ihuza abashoferi n'abagenzi. Abashoferi babona amafaranga yo kugabanya ikiguzi cya lisansi, abagenzi bakagenda neza ku giciro gito.

source: 📱 How It Works
fr: 📱 Comment ça marche
rw: 📱 Uko Bikora

# step1Title
source: Driver Posts Trip
fr: Le chauffeur publie le trajet
rw: Gutanga Urugendo

# step1Desc
source: A driver going to a destination lists their trip details (time, seats, price).
fr: Un chauffeur se rendant à une destination liste les détails de son trajet (heure, sièges, prix).
rw: Umushoferi atangaza urugendo rwe (igihe, imyanya, igiciro).

# step2Title
source: Passenger Books
fr: Le passager réserve
rw: Kubika Umwanya

# step2Desc
source: Passengers search for trips and book a seat instantly.
fr: Les passagers recherchent des trajets et réservent une place instantanément.
rw: Abagenzi bashakisha ingendo bakabika umwanya ako kanya.

# step3Title
source: Travel Together
fr: Voyager ensemble
rw: Kugendana

# step3Desc
source: They meet at the pickup point and enjoy the journey.
fr: Ils se rencontrent au point de ramassage et profitent du voyage.
rw: Bahurira aho bumvikanye bakaryoherwa n'urugendo.

# step4Title
source: Rate & Pay
fr: Noter et payer
rw: Kwishura & Amanota

# step4Desc
source: Payment is processed and both parties rate each other.
fr: Le paiement est traité et les deux parties se notent mutuellement.
rw: Kwishura birakorwa, hanyuma impande zombi zigahana amanota.

source: ⚡ Key Features
fr: ⚡ Fonctionnalités clés
rw: ⚡ Iby'ingenzi Birimo

# feat1Title
source: Verified Users
fr: Utilisateurs vérifiés
rw: Abagenzue

# feat1Desc
source: Identity and phone verification for security.
fr: Vérification d'identité et de téléphone pour la sécurité.
rw: Igenzura ry'Indangamuntu na Telefoni.

# feat2Title
source: Real-time Tracking
fr: Suivi en temps réel
rw: Ikurikirana

# feat2Desc
source: Share your live location for safety.
fr: Partagez votre position en direct pour la sécurité.
rw: Gusangiza aho uherereye ku mpamvu z'umutekano.

# feat3Title
source: Smart Search
fr: Recherche intelligente
rw: Gushakisha

# feat3Desc
source: Find trips by city, date, or price.
fr: Trouvez des trajets par ville, date ou prix.
rw: Shaka ukoresheje umujyi, itariki, cyangwa igiciro.

# feat4Title
source: Secure Payments
fr: Paiements sécurisés
rw: Kwishura Bizewe

# feat4Desc
source: Mobile Money & Card integration.
fr: Intégration Mobile Money et carte.
rw: Mobile Money & Ikarita ya Banki.

# feat5Title
source: Ratings & Reviews
fr: Évaluations et avis
rw: Amanota & Ibitekerezo

# feat5Desc
source: Build trust with community feedback.
fr: Construisez la confiance avec les commentaires de la communauté.
rw: Kubaka icyizere binyuze mu bitekerezo by'abandi.

# feat6Title
source: SOS & Safety
fr: SOS et sécurité
rw: Ubutabazi (SOS)

# feat6Desc
source: Emergency alerts and quick dialing.
fr: Alertes d'urgence et numérotation rapide.
rw: Gutabaza byihuse mu gihe cy'akaga.

source: 🌍 Our Impact
fr: 🌍 Notre impact
rw: 🌍 Ingaruka Nziza

# impact1
source: Reduces road congestion by optimizing empty seats.
fr: Réduit la congestion routière en optimisant les sièges vides.
rw: Kugabanya ubucucike mu muhanda.

# impact2
source: Decreases carbon footprint (Green Mobility).
fr: Diminue l'empreinte carbone (Mobilité verte).
rw: Kurengera ibidukikije (Green Mobility).

# impact3
source: Saves money for drivers and passengers.
fr: Économise de l'argent pour les chauffeurs et les passagers.
rw: Kuzigama amafaranga ku bashoferi n'abagenzi.

# vision2050Title
source: 🇷🇼 Alignment with Rwanda Vision 2050
fr: 🇷🇼 Alignement avec Vision 2050 du Rwanda
rw: 🇷🇼 Icyerekezo 2050

# vision2050Intro
source: iShare contributes directly to Rwanda Vision 2050 goals:
fr: iShare contribue directement aux objectifs de Vision 2050 du Rwanda:
rw: iShareitanga umusanzu mu Cyerekezo cy'u Rwanda 2050:

# visionPoint1
source: Smart cities & green mobility.
fr: Villes intelligentes et mobilité verte.
rw: Imijyiigezweho & Ingendo zirengera ibidukikije.

# visionPoint2
source: Digital service delivery.
fr: Prestation de services numériques.
rw: Gutanga serivisi hifashishijwe ikoranabuhanga.

# visionPoint3
source: Innovation & entrepreneurship.
fr: Innovation et entrepreneuriat.
rw: Guhanga udushya & Rwiyemezamirimo.

source: 🚀 Long-term Vision
fr: 🚀 Vision à long terme
rw: 🚀 Icyerekezo Kirambye

# longTermText
source: We aim to expand across East African Community (EAC), making cross-border travel seamless and affordable.
fr: Nous visons à nous étendre dans toute la Communauté d'Afrique de l'Est (CAE), rendant les voyages transfrontaliers fluides et abordables.
rw: Dufite intego yo kwagukira muri Afurika y'Iburasirazuba (EAC), tukoroshya ingendo zambukiranya imipaka.

source: Target Countries:
fr: Pays cibles:
rw: Ibihugu Twibandaho:

# countryUganda
source: Uganda
fr: Ouganda

# countryTanzania
source: Tanzania
fr: Tanzanie

# countryDRC
source: DRC
fr: RDC

# ipNotice
source: All rights reserved. This software is the intellectual property of iShare Rwanda.
fr: Tous droits réservés. Ce logiciel est la propriété intellectuelle d'iShare Rwanda. La reproduction ou distribution non autorisée est strictement interdite.
rw: Uburenganzira bwose burubahirijwe. Iyi porogaramu ni umutungo bwite wa iShare Rwanda.

# hereToHelp
source: We're here to help!
fr: Nous sommes là pour vous aider!
rw: Turi hano kugira ngo tugufashe!

# reachOutMsg
source: Contact us anytime, we'd love to hear from you
fr: Contactez-nous à tout moment, nous serions ravis de vous entendre
rw: Twandikire igihe icyo aricyo cyose, turishimira kumva ibitekerezo byawe

source: Find Us Here
fr: Trouvez-nous ici
rw: Aho Duherereye

source: Get In Touch
fr: Entrer en contact
rw: Vugana Natwe

source: Address
fr: Adresse
rw: Aderesi

source: Call Us
fr: Appelez-nous
rw: Duhamagare

source: Hours
fr: Heures
rw: Amasaha

source: Office Hours
fr: Heures de bureau
rw: Amasaha y'Akazi

# monFri
source: Monday - Friday
fr: Lundi - Vendredi
rw: Kuwa Mbere - Kuwa Gatanu

source: Saturday
fr: Samedi
rw: Kuwa Gatandatu

source: Sunday
fr: Dimanche
rw: Ku Cyumweru

source: Closed
fr: Fermé
rw: Hafunze

source: Connect With Us
fr: Connectez-vous avec nous
rw: Dukurikire

source: Have Questions?
fr: Vous avez des questions?
rw: Ufite Ibibazo?

# sendMessageDesc
source: Send us a message and we'll respond within 24 hours
fr: Envoyez-nous un message et nous vous répondrons dans les 24 heures
rw: Twoherereze ubutumwa, turagusubiza mu masaha 24

source: Send Message
fr: Envoyer un message
rw: Ohereza Ubutumwa

# driverVerificationTitle
source: Driver Verification
fr: Vérification du chauffeur
rw: Kugenzura Umushoferi

source: Why Verification?
fr: Pourquoi la vérification?
rw: Kubera iki kugenzura?

# verificationDesc
source: Verification ensures safety and trust for all users. Your information is kept secure and private.
fr: La vérification assure la sécurité et la confiance pour tous les utilisateurs. Vos informations sont gardées sécurisées et privées.
rw: Igenzura ryizeza umutekano n'icyizere kubakoresha bose. Amakuru yawe abikwa neza kandi mu ibanga.

source: Verification Submitted!
fr: Vérification soumise!
rw: Igenzura Ryoherejwe!

# verificationReviewMsg
source: Your verification request has been submitted. We'll review your information and notify you within 24-48 hours.
fr: Votre demande de vérification a été soumise. Nous examinerons vos informations et vous informerons dans les 24-48 heures.
rw: Ubusabe bwawe bwo kugenzurwa bwakiriwe. Tuzasuzuma amakuru yawe tubamenyeshe mu masaha 24-48.

source: My Activity
fr: Mon activité
rw: Ibikorwa byanjye

source: Booked Rides
fr: Trajets réservés
rw: Ingendo nabikije

source: Posted Rides
fr: Trajets publiés
rw: Ingendo natanze

source: Post Ride
fr: Publier un trajet
rw: Tanga urugendo

# noBookedRides
source: No booked rides yet
fr: Aucun trajet réservé pour le moment
rw: Nta rugendo urabikiza
