Repository: kellymugabo/ishare_backend
Catalog: ishare_app/lib/l10n/app_*.arb
Languages: fr, rw

# noBookedRidesDesc
source: Your upcoming trips will appear here.
fr: Vos prochains trajets apparaîtront ici.
rw: Ingendo zawe ziri imbere zizagaragara hano.

source: No posted rides
fr: Aucun trajet publié
rw: Nta rugendo watanze

# noPostedRidesDesc
source: Earn money by posting a trip today.
fr: Gagnez de l'argent en publiant un trajet aujourd'hui.
rw: Korera amafaranga utanga urugendo uyu munsi.

source: Seats
fr: Sièges
rw: Imyanya

source: Upcoming
fr: À venir
rw: Iri imbere

source: Completed
fr: Terminé
rw: Yarangiye

source: View Passengers
fr: Voir les passagers
rw: Reba abagenzi

source: Submit Verification
fr: Soumettre la vérification
rw: Ohereza Igenzura

# myTripsTitle
source: My Trips
fr: Mes Trajets
rw: Ingendo Zanjye

# bookedTab
source: Booked
fr: Réservé
rw: Nabikije

# offeredTab
source: Offered
fr: Offert
rw: Natanze

# noBookingsMessage
source: You haven't booked any trips yet.
fr: Aucun trajet réservé pour le moment.
rw: Nta rugendo urabikuza.

# noOffersMessage
source: You haven't posted any trips yet.
fr: Vous n'avez publié aucun trajet.
rw: Nta rugendo wari watanga.

# welcomeTitle
source: Welcome to iShare
fr: Bienvenue sur iShare
rw: Murakaza neza kuri iShare

# welcomeSubtitle
source: Your ride-sharing platform
fr: Votre plateforme de covoiturage
rw: Urubuga rwo gusangira ingendo

# statUsers
source: Users
fr: Utilisateurs
rw: Abakoresha

# statTrips
source: Trips
fr: Trajets
rw: Ingendo

# statRating
source: Rating
fr: Note
rw: Inota

source: Today
fr: Aujourd'hui
rw: Uyu munsi

source: No rides available
fr: Aucun trajet disponible
rw: Nta ngendo zihari ubu

# onboardTitle1
source: Travel with Confidence
fr: Voyagez en Toute Confiance
rw: Gendana Icyizere

# onboardDesc1
source: Verified drivers, real-time tracking, and 24/7 support.
fr: Chauffeurs vérifiés, suivi en temps réel et assistance 24/7.
rw: Abashoferi bagenzuwe, kurikirana urugendo, n'ubufasha bwa 24/7.

# onboardTitle2
source: Share Costs, Share Smiles
fr: Partagez les Frais, Partagez des Sourires
rw: Gabanya Ibiciro, Sangira Ibyishimo

# onboardDesc2
source: Connect with people on your route and save.
fr: Connectez-vous avec des gens sur votre route et économisez.
rw: Huza n'abajya aho ugiye maze uzigame amafaranga kuri buri rugendo.

# onboardTitle3
source: Fast & Reliable Transport
fr: Transport Rapide et Fiable
rw: Ingendo Zihuse Kandi Zizewe

# onboardDesc3
source: Find a ride in minutes. No more waiting.
fr: Trouvez un trajet en quelques minutes. Fini l'attente.
rw: Bona imodoka mu minota mike. Nta gutegereza ku byapa.

source: Get Started
fr: Commencer
rw: Tangira

# alreadyHaveAccount
source: Already have an account?
fr: Vous avez déjà un compte ?
rw: Ufite konti?

source: Login
fr: Connexion
rw: Injira

source: Username
fr: Nom d'utilisateur
rw: Izina ukoresha

source: Password
fr: Mot de passe
rw: Ijambo soko

source: Forgot password?
fr: Mot de passe oublié ?
rw: Wibagiwe ijambo soko?

# orContinue
source: Or continue with
fr: Ou continuer avec
rw: Cyangwa ukomeze na

# newToApp
source: New to iShare?
fr: Nouveau sur iShare ?
rw: Uri mushya kuri iShare?

source: Register
fr: S'inscrire
rw: Iyandikishe

# fillAllFields
source: Please fill all fields.
fr: Veuillez remplir tous les champs.
rw: Uzuza imyanya yose.

# incorrectCredentials
source: Incorrect credentials. Please try again.
fr: Identifiants incorrects. Veuillez réessayer.
rw: Amakuru watanze sizo. Ongera ugerageze.

# welcomeBack
source: Hello, Welcome Back!
fr: Bonjour, Bon retour !
rw: Muraho, Ikaze!

# loginSecurely
source: Log in securely to your iShare account.
fr: Connectez-vous en toute sécurité.
rw: Injira muri konti yawe ya iShare.

source: Create Account
fr: Créer un compte
rw: Fungura Konti

source: Join iShare
fr: Rejoindre iShare
rw: Iyandikishe kuri iShare

source: First Name
fr: Prénom
rw: Izina rya mbere

source: Last Name (Optional)
fr: Nom (Optionnel)
rw: Izina ryo hasi (Ubushake)

source: Email Address
fr: Adresse E-mail
rw: Imeyili

# registerAction
source: REGISTER
fr: S'INSCRIRE
rw: IYANDIKISHE

# fillAllRequired
source: Please fill all required fields.
fr: Veuillez remplir tous les champs obligatoires.
rw: Uzuza imyanya yose y'ingenzi.

# registrationSuccess
source: Registration successful! Please log in.
fr: Inscription réussie ! Veuillez vous connecter.
rw: Kwiyandikisha byakunze! Injira ubu.

source: Registration failed:
fr: Échec de l'inscription :
rw: Kwiyandikisha byanze:

source: My Ticket
fr: Mon Billet
rw: Itike Yanjye

# tripUnavailable
source: Trip details unavailable
fr: Détails du trajet indisponibles
rw: Imyirondoro y'urugendo ntabwo iboneka

source: Booking ID
fr: ID Réservation
rw: Nimero y'Itike

# bookedStatus
source: Booked
fr: Réservé(s)
rw: Yabikijwe

# driverLabel
source: Driver
fr: Conducteur
rw: Umushoferi

# ticketInstruction
source: Show this ticket to the driver before boarding.
fr: Présentez ce billet au chauffeur lors de l'embarquement.
rw: Erekana iyi tike umushoferi mbere yo kwinjira.

source: Trip Details
fr: Détails du Trajet
rw: Imyirondoro y'Urugendo

source: Estimated Earnings
fr: Gains Estimés
rw: Amafaranga Uteganya

source: Total Revenue
fr: Revenu Total
rw: Ayose Hamwe

source: Passenger Manifest
fr: Liste des Passagers
rw: Urutonde rw'Abagenzi

# bookedCount
source: {count} Booked
fr: {count} Réservé(s)
rw: {count} Babikije

# noPassengers
source: No passengers yet.
fr: Aucun passager pour le moment.
rw: Nta mugenzi uraboneka.

# paidStatus
source: PAID
fr: PAYÉ
rw: YISHYUWE

# cancelTripTitle
source: Cancel Trip?
fr: Annuler le trajet ?
rw: Guhagarika Urugendo?

# cancelTripMessage
source: This will cancel the trip for all passengers and notify them. Are you sure?
fr: Cela annulera le trajet pour tous les passagers et les notifiera. Êtes-vous sûr ?
rw: Ibi birahagarika urugendo kandi bimenyeshe abagenzi bose. Ubyemeje?

# keepTrip
source: No, Keep Trip
fr: Garder le trajet
rw: Oya, Reka rugumeho

source: Yes, Cancel
fr: Oui, Annuler
rw: Yego, Ruhagarike

source: Calling passenger...
fr: Appel du passager...
rw: Guhamagara umugenzi...

source: Error loading bookings:
fr: Erreur lors du chargement des réservations :
rw: Habaye ikibazo mu gushaka abagenzi:

# aboutSection
source: About
fr: À propos
rw: Ibyerekeye

# noBio
source: No biography provided.
fr: Aucune biographie fournie.
rw: Nta makuru yatanzwe.

source: Joined {date}
fr: Rejoint le {date}
rw: Yinjiye {date}

# vehicleSection
source: Vehicle
fr: Véhicule
rw: Ikinyabiziga

# noCarPhoto
source: No car photo available
fr: Aucune photo de voiture
rw: Nta foto y'imodoka ihari

source: Unknown model
fr: Modèle inconnu
rw: Ubwoko butazwi

source: No plate info
fr: Aucune plaque
rw: Nta pulake

# errorLoadProfile
source: Unable to load profile
fr: Impossible de charger le profil
rw: Ntibishoboye gufungura umwirondoro

# mapView
source: Map
fr: Carte
rw: Ikarita

# listView
source: List
fr: Liste
rw: Urutonde

source: Share Ride
fr: Partager le trajet
rw: Sangiza Urugendo

# shareMessage
source: Hey! I'm on a trip with ISHARE. 🚗 Driver: {driver} 🚙 Car: {car} 📍 Trip: {from} ➝ {to}
fr: Salut ! Je suis en route avec ISHARE. 🚗 Chauffeur : {driver} 🚙 Voiture : {car} 📍 Trajet : {from} ➝ {to}
rw: Yew! Ndi mu rugendo rwa ISHARE. 🚗 Shoferi: {driver} 🚙 Imodoka: {car} 📍 Urugendo: {from} ➝ {to}

# paymentAlreadyPaidTitle
source: Payment Already Made
fr: Paiement déjà effectué
rw: Kwishyura Byakozwe

# paymentAlreadyPaidMsg
source: This booking has already been paid. You can view it in your trips.
fr: Cette réservation a déjà été payée. Vous pouvez la voir dans vos trajets.
rw: Ubu butike bwamaze kwishyurwa. Ushobora kubirebera mu ngendo zawe.

source: View Trips
fr: Voir les trajets
rw: Reba Ingendo

source: Approve Payment
fr: Approuver le paiement
rw: Emeza Kwishyura

# checkPhoneTitle
source: Please check your phone.
fr: Veuillez vérifier votre téléphone.
rw: Reba kuri telefone yawe.

# sentPromptTo
source: A prompt has been sent to {phone}. Enter your PIN to approve.
fr: Une demande a été envoyée au {phone}. Entrez votre code PIN pour approuver.
rw: Ubutumwa bwoherejwe kuri {phone}. Shyiramo PIN yawe kwemeza.

source: I have approved
fr: J'ai approuvé
rw: Namaze kwemeza

# bankTransferSubtitle
source: Direct transfer
fr: Virement direct
rw: Kohereza kuri banki

# phoneHint
source: e.g: 0788123456
fr: ex: 0788123456
rw: urugero: 0788123456

# enterPhoneError
source: Please enter phone number
fr: Veuillez entrer le numéro de téléphone
rw: Shyiramo numero ya telefone

# invalidPhoneError
source: Invalid phone number
fr: Numéro de téléphone invalide
rw: Numero ya telefone ntabwo yemewe

source: Ride Requests
fr: Demandes de trajet
rw: Ubusabe bw'ingendo

source: Edit Profile
fr: Modifier le profil
rw: Hindura Umwirondoro

source: Payment Phone Number
fr: Numéro de téléphone pour paiement

# paymentInstructions
source: Please send the subscription amount to this phone number via Mobile Money (MTN/Airtel). After payment, your subscription will be activated automatically.
fr: Veuillez envoyer le montant de l'abonnement à ce numéro de téléphone via Mobile Money (MTN/Airtel). Après le paiement, votre abonnement sera activé automatiquement.

# subscriptionTitle
source: Subscription
fr: Abonnement

source: Subscription Status
fr: Statut de l'abonnement

source: Trial Period
fr: Période d'essai

source: Active Subscription
fr: Abonnement actif

source: Subscription Expired
fr: Abonnement expiré

# daysRemaining
source: {days} days remaining
fr: {days} jours restants

# pleaseRenewSubscription
source: Please renew to continue using iShare
fr: Veuillez renouveler pour continuer à utiliser iShare

source: Subscription Plans
fr: Plans d'abonnement

source: per month
fr: par mois

source: Renew Subscription
fr: Renouveler l'abonnement

source: Subscribe Now
fr: S'abonner maintenant

# payAmount
source: Pay {amount} RWF
fr: Payer {amount} RWF

# trialEndsIn
source: Your trial ends in {days} days. Subscribe now to continue using iShare after the trial.
fr: Votre période d'essai se termine dans {days} jours. Abonnez-vous maintenant pour continuer à utiliser iShare après l'essai.

# paymentViaMobileMoney
source: Payment via Mobile Money (MTN/Airtel)
fr: Paiement via Mobile Money (MTN/Airtel)

# passengerLabel
source: Passenger
fr: Passager

source: Destination
rw: Aho ujya

source: Ambulance
rw: Imbangukiragutabara

# visionTitle
source: 🎯 Vision
rw: 🎯 Icyerekezo

# missionTitle
source: 🚀 Mission
rw: 🚀 Intego Nyamukuru

source: Directions
rw: Inzira

source: Email
rw: Imeri

# dateLabel
source: Date
rw: Itariki

source: OK
rw: Sawa
